firstCrude2D/we123/h10_refined/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       28560;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       28620;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       28680;
    }
    atmosphere
    {
        type            patch;
        nFaces          240;
        startFace       28800;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28800;
        startFace       29040;
    }
)

// ************************************************************************* //
